Table of Contents
 Class IdeaLoadGroup
Namespace
IdeaStatiCa.BimApiLink.BimApi
Assembly
IdeaStatiCa.BimApiLink.dll
public class IdeaLoadGroup : AbstractIdeaObject<IIdeaLoadGroup>, IEquatable<AbstractIdeaObject<IIdeaLoadGroup>>, IIdeaLoadGroup, IIdeaObject
Inheritance
object
ScopeAwareObject
BimLinkObject
AbstractIdeaObject<IIdeaLoadGroup>
IdeaLoadGroup
Implements
IEquatable<AbstractIdeaObject<IIdeaLoadGroup>>
IIdeaLoadGroup
IIdeaObject
Inherited Members
 AbstractIdeaObject<IIdeaLoadGroup>.Id
 AbstractIdeaObject<IIdeaLoadGroup>.Name
 AbstractIdeaObject<IIdeaLoadGroup>.Identifier
 AbstractIdeaObject<IIdeaLoadGroup>.GetHashCode()
 AbstractIdeaObject<IIdeaLoadGroup>.Equals(object)
 AbstractIdeaObject<IIdeaLoadGroup>.Equals(AbstractIdeaObject<IIdeaLoadGroup>)
 BimLinkObject.Get<T>(Identifier<T>)
 BimLinkObject.Get<T>(int)
 BimLinkObject.Get<T>(string)
 BimLinkObject.GetMaybe<T>(Identifier<T>)
 BimLinkObject.GetMaybe<T>(int)
 BimLinkObject.GetMaybe<T>(string)
 BimLinkObject.CountryCode
 BimLinkObject.UserData
 ScopeAwareObject.Scope
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 IdeaLoadGroup(Identifier<IIdeaLoadGroup>)
public IdeaLoadGroup(Identifier<IIdeaLoadGroup> identifer)
Parameters
identifer Identifier<IIdeaLoadGroup>
 IdeaLoadGroup(int)
public IdeaLoadGroup(int id)
Parameters
id int
 IdeaLoadGroup(string)
public IdeaLoadGroup(string id)
Parameters
id string
Properties
 Dzeta
ζ
public virtual double Dzeta { get; set; }
Property Value
double
 GammaGInf
γ G,Inf
public virtual double GammaGInf { get; set; }
Property Value
double
 GammaGSup
γ G,Sup
public virtual double GammaGSup { get; set; }
Property Value
double
 GammaQ
γ Q
public virtual double GammaQ { get; set; }
Property Value
double
 GroupType
Group type
public virtual LoadGroupType GroupType { get; set; }
Property Value
LoadGroupType
 Psi0
ψ 0
public virtual double Psi0 { get; set; }
Property Value
double
 Psi1
ψ 1
public virtual double Psi1 { get; set; }
Property Value
double
 Psi2
ψ 2
public virtual double Psi2 { get; set; }
Property Value
double
 Relation
Relation
public virtual Relation Relation { get; set; }
Property Value
Relation
 Edit this page